Revit 2027 API
MEPAnalyticalNode Methods
The MEPAnalyticalNode type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsSameNode |  Verify if this node is connected to the other node and thus represents the same analytical node in the network.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
MEPAnalyticalNode Class
Autodesk.Revit.DB.Analysis Namespace